import random
from time import sleep
from colorama import *
init()

incorrect = 0
correct = 0

def logo_ascii():
    print('                  /(#%%%%%%%%#(%#######(/(((***...                                                 ')
    sleep(0.2)
    print('             .(#****/#&(//(((((///////(/(((((((#########%####(#&@@&(((((((////////**/(***,,,...    ')
    sleep(0.2)
    print('         ,((/******/#%&((((((((/(/(///(///////////(//*///*//##%&@&%/*********,,*,,,,,,,,,,*/*(*    ')
    sleep(0.2)
    print('     /((****,******/#%&((((((/((/((%&##((#%%#(//////////*///((#&@%//****,*,****/*,**,,,,,,,,*//    ')
    sleep(0.2)
    print('   ********,,**,**/#%&(((((((((&%      *.   , #(///////**,***/#&%(***//*****(/*,&&(/*,.,/*,,(/     ')
    sleep(0.2)
    print('   /***********,,*/#%&((((((/(% .   *    (#/    #(*/(/*,,,,,*%&@%@***//****///**@&#(((//#**,((     ')
    sleep(0.2)
    print('    ******,********/#%&(((((//#.        %%        (///////(/*///*/&#*****/(///***&&######/*,*(/    ')
    sleep(0.2)
    print('   /***,*******,,*/##&(((((%((((((/****.,..,****///(/*//////////*/*&#//****/******,*********(/     ')
    sleep(0.2)
    print('    *******,******,/#%&((((((((((/((((/(((((((//////((/////////**///*(&(*/#(*/#**&@&%#####***((    ')
    sleep(0.2)
    print('    /**************/#%&(((((((((((((/(((((((/(/((////*/////////////(////////#/***@@&&&&&&%***((    ')
    sleep(0.2)
    print('    /*,*****,*******/#%(((((##(((((((((((((((/((%%..     /#%#(/**///////*/#(/##/*@@&&&&&&#/**((    ')
    sleep(0.2)
    print('    **************,/#%&(((((##(((((((((((((((&, ..    @    #  ,%/*//////////////////////*(***#(    ')
    sleep(0.2)
    print('    /***,**********/#%&(((((##((((((((((((/(, ., ,#       (     ((////////////////////////**/#(    ')
    sleep(0.2)
    print('    /**************/#%&((/((##(((((((((((((*   ** #%%/     .*    %(///////////////////////*//#(    ')
    sleep(0.2)
    print('    *******,,******/(#&(((((&%(((((((((#(// /%%*            ,%%, (/((///(////////*///////////(/    ')
    sleep(0.2)
    print('    /*******,******/#%&((((((((((((((((((#%%%#####################((///(/////////////////////##    ')
    sleep(0.2)
    print('    /**************/#%&((&/..........((%..........((*..........((////////(/////(/********////##    ')
    sleep(0.2)
    print('    /***********,*,/#%&((&.......@@#.((*..........((..*@@&&&@/.((((((((((((//@@@@@@@@@# /@@@(#(    ')
    sleep(0.2)
    print('    /**************/(%&((%...../@/@#.((*..........((........,@,(((@@@@@@@@(((@@@@@@@@*.@@@@@/%#    ')
    sleep(0.2)
    print('    /**************/#%&((%...,@@*.@#,((,....@#,...((.,,,,@@@&/.((((((((/(((((@@@@@@@# @@@@@@/%#    ')
    sleep(0.2)
    print('    /*,*****,******/(#&((%,,*@@,,,@#,((,,###@@&&(,((,,,,,,,,&@,((((((((((((((@@@@@@& #@@@@@@(%#    ')
    sleep(0.2)
    print('    **,************/#%&((%,#@@@@@@@@%&(*,,,,@%,,,,((,,,,,,,,*@*(((@@%%%&&%(((@@@@@( *@@@@@@@(%#    ')
    sleep(0.2)
    print('    /**,**,******,*/#%&#(%********@%*((/****(/****((**(@@@@@&**((((((((((((((@@@@@ @@@@@@@@@(%#    ')
    sleep(0.2)
    print('    /***************#%&((&***********((/**********((///***//*/*((((((((((((((((((((((((((((((%#    ')
    sleep(0.2)
    print('    /**,***********/#%&((%#(/((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((%#    ')
    sleep(0.2)
    print('    /**************/#%&(((#((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((%#    ')
    sleep(0.2)
    print('    /**************/#%&#((#(#((##(###(((((((((((((((#((((((((((((((((((((((((((((((((((((((((%%    ')
    sleep(0.2)
    print('    ,//*********,,**/#%((#(((((#((##(((((((((((((((((((((((#(((#(((%%#(%#(####(##(#(####(((((%%    ')
    sleep(0.2)
    print('        (/*******,*/#%&#((((##%(##%((#%((#(%(####(##(((#%(##((%##(#((((%####(#(#(##(###%(((((%%    ')
    sleep(0.2)
    print('           ,(/*****/#%&#(((((%#%%#%(###%(((%(((##(##(((######%(#%#(#%%###(##(((######%%%%&&&&&%    ')
    sleep(0.2)
    print('               (//*/#%&(#((###################%%%%%&&%&%#&%%%%%%%#%%%%%%%##((***...                ')
    sleep(0.2)
    print('                  ,(/#%%%%%%%##%%%%%#%(//***,,                                                     ')
    sleep(1)

def sum():
    global correct, incorrect
    num1 = random.randint(0,9)
    num2 = random.randint(0,9)

    result = num1 + num2

    que = input(Fore.YELLOW + f'{num1} + {num2} = ')
    if que == str(result):
        print(Fore.GREEN + 'Правильно!')
        correct += 1
    elif que == '/quit':
        main()
    else:
        print(Fore.RED + "Неправильно! Правильный ответ:", result)
        incorrect += 1

def min():
    num1 = random.randint(0,9)
    num2 = random.randint(0,9)
    global correct, incorrect

    result = num1 - num2

    que = input(Fore.YELLOW + f'{num1} - {num2} = ')
    if que == str(result):
        print(Fore.GREEN + 'Правильно!')
        correct += 1
    elif que == '/quit':
        main()
    else:
        print(Fore.RED + "Неправильно! Правильный ответ:", result)

def double():
    global correct, incorrect
    num1 = random.randint(0,9)
    num2 = random.randint(0,9)

    result = num1 * num2

    que = input(Fore.YELLOW + f'{num1} * {num2} = ')
    if que == str(result):
        print(Fore.GREEN + 'Правильно!')
        correct += 1
    elif que == '/quit':
        main()
    else:
        print(Fore.RED + "Неправильно! Правильный ответ:", result)

def test_passed():
    global correct, incorrect
    print()
    sleep(1)
    print(Fore.RESET + 'Вы прошли тест!')
    print()
    sleep(1)
    print(Fore.GREEN + f'правильно - {correct}')
    print()
    sleep(1)
    print(Fore.RED + f'не правильно - {incorrect}')
    print()
    sleep(1)

    total_questions = correct + incorrect
    if total_questions > 0:
        average_score = correct / total_questions
        print(f'Средний балл: {average_score}')
        print()
    else:
        print('Средний балл: 0.0')
        print()
    req = input('Напишите что-нибудь, чтобы вернуться в главное меню(Если хотите выйти, напишите /quit): ')
    if req == '/quit':
        quit()
    incorrect = 0
    correct = 0

def main():
    global correct, incorrect
    sleep(1)
    print(Fore.BLUE + 'Совет: что-бы выйти из режима в любой момент напечатайте в поле с ответами: /quit')
    sleep(3)
    symbols_que = input('Выбрите знак с которым будете тренироваться(+,-,*)(/quit тут работает!): ')
    
    if symbols_que == '/quit':
        quit()
    
    que_num = int(input('Сколько примеров вы хотите решить?: '))
    print(Fore.GREEN + 'Готово! Обратный отчёт! 3..')
    sleep(1)
    print('2..')
    sleep(1)
    print('1..')
    sleep(1)

    if symbols_que == '+':
        for _ in range(que_num):
            sum()
        test_passed()
        main()
    elif symbols_que == '-':
        for _ in range(que_num):
            min()
        test_passed()
        main()
    elif symbols_que == '*':
        for _ in range(que_num):
            double()
        test_passed()
        main()
    else:
        print('Данного выбранного режима не существует')
        main()

def frs_main():
    logo_ascii()
    main()

frs_main()